SetWorksetVisibility Method
 Sets visibility for a workset in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetWorksetVisibility(
	WorksetId worksetId,
	WorksetVisibility visible
)
Visual Basic
Public Sub SetWorksetVisibility ( _
	worksetId As WorksetId, _
	visible As WorksetVisibility _
)
Visual C++
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	WorksetVisibility visible
)
Parameters
worksetId
Type: Autodesk.Revit.DBWorksetId
 Id of the workset.
visible
Type: Autodesk.Revit.DBWorksetVisibility
 The visibility of the workset.
Remarks
 It works even when the workset is closed. This settings overrules implicit visibility of the workset (for this particular view only).
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  There is no workset with this Id in the document associated with this view.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →